In [38]:
from unidecode import  unidecode
s = 'CERETÉ'
unidecode(s)

'CERETE'

In [39]:
# Calculo de la diferenica entre 2 fechas
from datetime import datetime
navidad = datetime.strptime("2021-12-25", "%Y-%m-%d")
fin_anio = datetime.strptime("2021-12-31", "%Y-%m-%d")
diferencia = fin_anio-navidad
print(f"La diferencia es de {diferencia.days} días y {diferencia.seconds} segundos. La diferencia total es de {diferencia.total_seconds()} segundos")

La diferencia es de 6 días y 0 segundos. La diferencia total es de 518400.0 segundos

In [40]:
import pandas as pd
df = pd.DataFrame({'A': 'a a b'.split(),
                   'B': [1,2,3],
                   'C': [4,6,5]})
g1 = df.groupby('A')
g2 = df.groupby('A', group_keys=True)

In [41]:
df

   A  B  C
0  a  1  4
1  a  2  6
2  b  3  5

In [42]:
df.groupby('A', group_keys=False)

In [43]:
g1[['B', 'C']].count()

   B  C
A
a  2  2
b  1  1

In [44]:
def function1(x):
    if x < 3:
        z = x / x.sum()
    else:
        z=x
    return z

In [45]:
d = {'yearmonth': [201202,201202,201202,201203,201203], 'return': [0.922132, 0.220270,0.228856,0.277170,0.747347]}
df1 = pd.DataFrame(data=d)

In [46]:
df1

   yearmonth    return
0     201202  0.922132
1     201202  0.220270
2     201202  0.228856
3     201203  0.277170
4     201203  0.747347

In [47]:
def add_mkt_return(grp):
    if grp["return"] < 0.3:
        grp['mkt_return'] = grp['return'].count()
    else:
        grp['mkt_return'] = 0
    return grp

In [48]:
# Suponiendo que se  tiene un vetor
vector_A = [2,5,6]
print("La suma del vector es: ",sum(vector_A))

La suma del vector es:  13

In [49]:
import pandas as pd
# Forma Estandar
dfPrueba = pd.DataFrame([('FrL',9,11,40),('FAr',22,27,40),('FA',50,61,40)], columns=["textura","acm","porc","id"])
dfPrueba

  textura  acm  porc  id
0     FrL    9    11  40
1     FAr   22    27  40
2      FA   50    61  40

In [50]:
# Tengo otro nuevo dataset
# Se crea un nuevo dataframe donde se almacenan las diferentes texturas del suelo
tablaTexturas = pd.DataFrame(["A","Ar","ArA","ArL","FrL","L","F","ArF","FAr","FA","AF"], columns=['textura'])
tablaTexturas

   textura
0        A
1       Ar
2      ArA
3      ArL
4      FrL
5        L
6        F
7      ArF
8      FAr
9       FA
10      AF

In [51]:
copia2 = tablaTexturas.set_index('textura').join(dfPrueba.set_index('textura')).reset_index(drop=False)
copia2

   textura   acm  porc    id
0        A   NaN   NaN   NaN
1       Ar   NaN   NaN   NaN
2      ArA   NaN   NaN   NaN
3      ArL   NaN   NaN   NaN
4      FrL   9.0  11.0  40.0
5        L   NaN   NaN   NaN
6        F   NaN   NaN   NaN
7      ArF   NaN   NaN   NaN
8      FAr  22.0  27.0  40.0
9       FA  50.0  61.0  40.0
10      AF   NaN   NaN   NaN

In [52]:
# Quiero unir estos 2 dataframes por medio de la clave Textura
copia3 = tablaTexturas.set_index('textura').join(dfPrueba.set_index('textura')).reset_index(drop=False)
copia3

   textura   acm  porc    id
0        A   NaN   NaN   NaN
1       Ar   NaN   NaN   NaN
2      ArA   NaN   NaN   NaN
3      ArL   NaN   NaN   NaN
4      FrL   9.0  11.0  40.0
5        L   NaN   NaN   NaN
6        F   NaN   NaN   NaN
7      ArF   NaN   NaN   NaN
8      FAr  22.0  27.0  40.0
9       FA  50.0  61.0  40.0
10      AF   NaN   NaN   NaN

In [53]:
# Para unir o concatenar varios datasets
dataFinall = pd.concat([copia2,copia3], ignore_index=True)
dataFinall

   textura   acm  porc    id
0        A   NaN   NaN   NaN
1       Ar   NaN   NaN   NaN
2      ArA   NaN   NaN   NaN
3      ArL   NaN   NaN   NaN
4      FrL   9.0  11.0  40.0
5        L   NaN   NaN   NaN
6        F   NaN   NaN   NaN
7      ArF   NaN   NaN   NaN
8      FAr  22.0  27.0  40.0
9       FA  50.0  61.0  40.0
10      AF   NaN   NaN   NaN
11       A   NaN   NaN   NaN
12      Ar   NaN   NaN   NaN
13     ArA   NaN   NaN   NaN
14     ArL   NaN   NaN   NaN
15     FrL   9.0  11.0  40.0
16       L   NaN   NaN   NaN
17       F   NaN   NaN   NaN
18     ArF   NaN   NaN   NaN
19     FAr  22.0  27.0  40.0
20      FA  50.0  61.0  40.0
21      AF   NaN   NaN   NaN

In [54]:
# Definicion del datset original

def porcentajeTextura(Espesor):
    ListaPorcentajeTextura = []
    s = sum(Espesor)
    print(s)

    for i in  Espesor:
        r3= (i * 100)/s
        ListaPorcentajeTextura.append(r3)
    return ListaPorcentajeTextura

In [55]:
Espesor = [22, 9, 50]

print(porcentajeTextura(Espesor))

81
[27.160493827160494, 11.11111111111111, 61.72839506172839]

In [56]:
# Prueba conversion dataset a la forma estandar para posterioremente realiar el mergue  con la tabla base
import pandas as pd
# Forma Estandar
dfEstandar = pd.DataFrame([(40,["FAr", "FrL", "FA"],[22, 9, 50],[27.160493827160494, 11.11111111111111, 61.728]),
                            (41,["FAr", "FAr", "ArL"],[20, 14, 36], [28.571428571428573, 20.0, 51.42857142857143]),
                            (42,["FAr", "FAr", "AF"],[26, 14, 38],  [33.333333333333336, 17.94871794871795, 48.717]),
                            (43,["FAr", "FAr"],[26, 44],  [37.14, 62.85])], columns=["id","textura","esp","porc"])
dfEstandar

,id,textura,esp,porc
0,40,"[FAr, FrL, FA]","[22, 9, 50]","[27.160493827160494, 11.11111111111111, 61.728]"
1,41,"[FAr, FAr, ArL]","[20, 14, 36]","[28.571428571428573, 20.0, 51.42857142857143]"
2,42,"[FAr, FAr, AF]","[26, 14, 38]","[33.333333333333336, 17.94871794871795, 48.717]"
3,43,"[FAr, FAr]","[26, 44]","[37.14, 62.85]"

In [57]:
dfEstandar.loc[0]

id                                                      40
textura                                     [FAr, FrL, FA]
esp                                            [22, 9, 50]
porc       [27.160493827160494, 11.11111111111111, 61.728]
Name: 0, dtype: object

In [58]:
NuevoDataframe = pd.DataFrame({'id':dfEstandar.loc[0].id,'textura':dfEstandar.loc[0].textura, 'esp': dfEstandar.loc[0].esp,'porc': dfEstandar.loc[0].porc})

In [59]:
NuevoDataframe

   id textura  esp       porc
0  40     FAr   22  27.160494
1  40     FrL    9  11.111111
2  40      FA   50  61.728000

In [60]:
# Una vez tengo el dataset de esta forma se procede a realizar el join y merge con el siguiente dataset
porcetajesTexturas = tablaTexturas.set_index('textura').join(NuevoDataframe.set_index('textura')).reset_index(drop=False)
porcetajesTexturas.sort_values(by='porc', ascending=False)

   textura    id   esp       porc
9       FA  40.0  50.0  61.728000
8      FAr  40.0  22.0  27.160494
4      FrL  40.0   9.0  11.111111
0        A   NaN   NaN        NaN
1       Ar   NaN   NaN        NaN
2      ArA   NaN   NaN        NaN
3      ArL   NaN   NaN        NaN
5        L   NaN   NaN        NaN
6        F   NaN   NaN        NaN
7      ArF   NaN   NaN        NaN
10      AF   NaN   NaN        NaN

In [61]:
# Funcion para realizar la conversion de un dataframe a la forma xxxxx
import time

df = dfEstandar
# Dataset dimensions
print(len(df))
# Build dictionary
for i in range (0,len(df)):
    dicc = {
        'textura':df.loc[i].textura,
        'esp':df.loc[i].esp,
        'porc':df.loc[i].porc,
        'id':df.loc[i].id
    }

    NewDfm = pd.DataFrame(data=dicc)
    NewDf = NewDfm.groupby(by=["textura","id"]).sum().reset_index(drop=False)
    print(NewDf)
    # Una vez tengo el dataset de esta forma se procede a realizar el join y merge con el siguiente dataset
    tablaPorcetajesTexturas = tablaTexturas.set_index('textura').join(NewDf.set_index('textura')).reset_index(drop=False).sort_values(by='porc', ascending=False)
    if i > 0:
        FinalDf = pd.concat([FinalDf,tablaPorcetajesTexturas], ignore_index=True)
    else:
        FinalDf = tablaPorcetajesTexturas
# Return new df

4
  textura  id  esp       porc
0      FA  40   50  61.728000
1     FAr  40   22  27.160494
2     FrL  40    9  11.111111
  textura  id  esp       porc
0     ArL  41   36  51.428571
1     FAr  41   34  48.571429
  textura  id  esp       porc
0      AF  42   38  48.717000
1     FAr  42   40  51.282051
  textura  id  esp   porc
0     FAr  43   70  99.99

In [62]:
FinalDf

   textura    id   esp       porc
0       FA  40.0  50.0  61.728000
1      FAr  40.0  22.0  27.160494
2      FrL  40.0   9.0  11.111111
3        A   NaN   NaN        NaN
4       Ar   NaN   NaN        NaN
5      ArA   NaN   NaN        NaN
6      ArL   NaN   NaN        NaN
7        L   NaN   NaN        NaN
8        F   NaN   NaN        NaN
9      ArF   NaN   NaN        NaN
10      AF   NaN   NaN        NaN
11     ArL  41.0  36.0  51.428571
12     FAr  41.0  34.0  48.571429
13       A   NaN   NaN        NaN
14      Ar   NaN   NaN        NaN
15     ArA   NaN   NaN        NaN
16     FrL   NaN   NaN        NaN
17       L   NaN   NaN        NaN
18       F   NaN   NaN        NaN
19     ArF   NaN   NaN        NaN
20      FA   NaN   NaN        NaN
21      AF   NaN   NaN        NaN
22     FAr  42.0  40.0  51.282051
23      AF  42.0  38.0  48.717000
24       A   NaN   NaN        NaN
25      Ar   NaN   NaN        NaN
26     ArA   NaN   NaN        NaN
27     ArL   NaN   NaN        NaN
28     FrL   NaN   NaN        NaN
29       L   NaN   NaN        NaN
30       F   NaN   NaN        NaN
31     ArF   NaN   NaN        NaN
32      FA   NaN   NaN        NaN
33     FAr  43.0  70.0  99.990000
34       A   NaN   NaN        NaN
35      Ar   NaN   NaN        NaN
36     ArA   NaN   NaN        NaN
37     ArL   NaN   NaN        NaN
38     FrL   NaN   NaN        NaN
39       L   NaN   NaN        NaN
40       F   NaN   NaN        NaN
41     ArF   NaN   NaN        NaN
42      FA   NaN   NaN        NaN
43      AF   NaN   NaN        NaN

In [63]:
# Ejemplo de prueba antes de calculas porcentajes y realizar operaciones es necesario 
# agruar los registros de acuerdo a la textura del suelo...

dfEstandar

,id,textura,esp,porc
0,40,"[FAr, FrL, FA]","[22, 9, 50]","[27.160493827160494, 11.11111111111111, 61.728]"
1,41,"[FAr, FAr, ArL]","[20, 14, 36]","[28.571428571428573, 20.0, 51.42857142857143]"
2,42,"[FAr, FAr, AF]","[26, 14, 38]","[33.333333333333336, 17.94871794871795, 48.717]"
3,43,"[FAr, FAr]","[26, 44]","[37.14, 62.85]"

In [81]:
NuevoDataframePrueba = pd.DataFrame({'id':dfEstandar.loc[1].id,'textura':dfEstandar.loc[1].textura, 'esp': dfEstandar.loc[1].esp,'porc': dfEstandar.loc[1].porc})
NuevoDataframePrueba

   id textura  esp       porc
0  41     FAr   20  28.571429
1  41     FAr   14  20.000000
2  41     ArL   36  51.428571

In [65]:
#  Group by (Funcionamiento)

l = [[1, 2, 3], [1, None, 4], [2, 1, 3], [1, 2, 2]]
df = pd.DataFrame(l, columns=["a", "b", "c"])
df

   a    b  c
0  1  2.0  3
1  1  NaN  4
2  2  1.0  3
3  1  2.0  2

In [66]:
df.groupby(by=["b"]).sum()

     a  c
b
1.0  2  3
2.0  2  5

In [67]:
df = pd.DataFrame({'Animal': ['Falcon', 'Falcon',
                              'Parrot', 'Parrot'],
                   'Max Speed': [380., 370., 24., 26.]})

df

   Animal  Max Speed
0  Falcon      380.0
1  Falcon      370.0
2  Parrot       24.0
3  Parrot       26.0

In [68]:
df.groupby("Animal", group_keys=True).apply(lambda x: x)

   Animal  Max Speed
0  Falcon      380.0
1  Falcon      370.0
2  Parrot       24.0
3  Parrot       26.0

In [69]:
df.groupby("Animal", group_keys=False).apply(lambda x: x)

   Animal  Max Speed
0  Falcon      380.0
1  Falcon      370.0
2  Parrot       24.0
3  Parrot       26.0

In [70]:
# Se aplica el nuevo concepto al nuevo dataframe
NuevoDataframePrueba.groupby(by=["textura","id"]).sum().reset_index(drop=False)

  textura  id  esp       porc
0     ArL  41   36  51.428571
1     FAr  41   34  48.571429

In [82]:
# Se aplica el nuevo concepto al nuevo dataframe
NuevoDataframePrueba.groupby(by=["textura","id"])["porc"].sum().reset_index(drop=False)

  textura  id       porc
0     ArL  41  51.428571
1     FAr  41  48.571429

In [71]:
# Que pasa si los IDs de un dataset no son unicos
# Forma Estandar
dfPrueba = pd.DataFrame([('FrL',9,11,40),('FAr',22,27,40),('FA',50,61,40)], columns=["textura","acm","porc","id"])
import pandas as pd
df1 = pd.DataFrame([(1,"ger","M"),(2,"HER","L"),(3,"lUIS","YAND"),(4,"HOM","CHA"),(2,"HER","L")], columns=["id","nombre","apellido"])

In [72]:
df1

   id nombre apellido
0   1    ger        M
1   2    HER        L
2   3   lUIS     YAND
3   4    HOM      CHA
4   2    HER        L

In [73]:
# Ids Unicos
df1.id.unique()

array([1, 2, 3, 4], dtype=int64)

In [74]:
# Conteo de IDs con valore unicos
df1.id.value_counts()

2    2
1    1
3    1
4    1
Name: id, dtype: int64

In [75]:
# Se crea el df2
df2 = pd.DataFrame([(1,"Bra"),(2,"Mex"),(3,"Ger"),(4,"Eng"),], columns=["id","ciudad"])
df2

   id ciudad
0   1    Bra
1   2    Mex
2   3    Ger
3   4    Eng

In [76]:
df3 = pd.DataFrame([(1,"Bra1"),(2,"Mex1"),(3,"Ger1"),(4,"Eng1"),], columns=["id","Estado"])

In [77]:
dfm1 = pd.merge(df1,df2)

In [78]:
dfm1

   id nombre apellido ciudad
0   1    ger        M    Bra
1   2    HER        L    Mex
2   2    HER        L    Mex
3   3   lUIS     YAND    Ger
4   4    HOM      CHA    Eng

In [79]:
# Hacemos el segundo merge para determianr que esta pasando
dfm2 = pd.merge(dfm1,df3)

In [80]:
dfm2

   id nombre apellido ciudad Estado
0   1    ger        M    Bra   Bra1
1   2    HER        L    Mex   Mex1
2   2    HER        L    Mex   Mex1
3   3   lUIS     YAND    Ger   Ger1
4   4    HOM      CHA    Eng   Eng1